{
  "intents": [
    {
      "tag": "salutation",
      "patterns": [
        "Bonjour",
        "Salut",
        "Coucou",
        "Bonjour, comment ça va ?",
        "Bonjour,  comment allez-vous ?",
        "Salut, ça va ?"
      ],
      "responses": [
        "Salut nous sommes ravis de vous aider dans l'exploration du numerique",
        "Bonjour, bienvenu nous sommes ravis de vous aider dans l'exploration du numerique",
        "Bojour,bienvenu nous sommes ravis de vous aider dans l'exploration du numerique",
        "Bonjour, que puis-je faire pour vous ?",
        "Salut, comment puis-je vous aider ?",
        "Bonjour Je vais bien, merci! Et vous ?",
        "Bonjour Ca va au Top! et Vous?"
      ]
    },
    {
       "tag":"gmail",
       "patterns":[
            "Comment creer un compte gmail ?",
            "J'ai oublie le mot de passe de mon compte gmail",
            "J'arrive a acceder a mon compte gmail ?",
            "Je veux joindre un fichier par mail",
            "J'arrive pas à joindre un fichier par mail"
          ],
      "responses": [
        "Pour creer un compte gmail aller à la page ressource y'a des videos la-bas",
        "Pour savoir comment recuperer votre mot de passe aller à la page ressource y'a des videos la-bas",
        "Pour savoir comment joindre votre fichier à un mail sur gmail aller à la page ressource y'a des videos la-bas"
      ]
    },
    {
      "tag":"google",
      "patterns":[
           "Comment creer un compte google ?",
           "Je veux creer un compte google ?",
           "J'ai oublie le mot de passe de mon compte google"
         ],
     "responses": [
       "Pour creer un compte google aller à la page ressource y'a des videos la-bas",
       "Pour savoir comment recuperer votre mot de passe google aller à la page ressource y'a des videos la-bas" 
     ]

   },
    {
      "tag": "au_revoir",
      "patterns": ["Au revoir", "À plus tard", "À bientôt","A la prochaine"],
      "responses": [
        "A bientôt, merci de votre visite",
        "Bonne journée",
        "Au revoir ! Revenez bientôt.",
        "Au revoir n'esitez pas à revenir pour d'autres question!"
      ]
    },
    {
      "tag": "merci",
      "patterns": ["Merci", "Merci beaucoup", "C'est utile", "Merci beaucoup !"],
      "responses": ["Heureux de pouvoir vous aider !", "De rien !", "C'est un  plaisir !","Je suis la pour vous aider"]
    },
    {
      "tag": "qr",
      "patterns": [
        "Comment scanner un qr code?",
        "Je dois scanner un QR code mais j'arrive pas ?",
        "J'ai un probleme pour scanner un QR code?",
        "je veux des videos sur l'utilisation de Qr code",
        "Je'aimerai apprendre à utiliser les qr code",
        "Je veux apprendre à utiliser les qr code"
      ],
      "responses": [
        "Pour savoir comment scanner un QR code aller à la page ressource",
        "Si t'a un probleme sur l'utilisation du QR code aller à la page ressource",
        "Pour toute information sur l'utilisation du QR code aller à la page ressource"
      ]
    },
    {
        "tag":"aide",
        "patterns":[
            "Peux-tu m'aider svp ?",
            "J'ai un probleme ?",
            "Pouvez-vous m'aider s'il vous plait?",
            "J'ai un souci",
            "J'ai besoin d'aide",
            "Aider moi"
        ],
        "responses":[
            "Bien sûr ! Je suis là pour vous aider. Que puis-je faire pour vous aujourd'hui ?",
            "Je suis là pour vous aider. Quel est votre souci ?",
            "Pouvez-vous m'expliquer votre probleme",
            "Pouvez-vous m'expliquer votre souci"
        ]
    },
    {
      "tag": "thématiques",
      "patterns": [
        "thématiques ?",
        "domaines ?",
        "Quels sont vos domaine d'expertise ?",
        "Vos thématiques ?",
        "Vos dommaines ?",
        "Quelles sont vos thématiques ?",
        "Quelles thématiques je peux vous poser une question ?"
      ],
      "responses": [
        "Nous pouvons vous aider sur la thematique medical,Administratif,Securite,Base internet",
        "Nous pouvons vous aider sur plusieurs dommaines comme medical,Administratif,Securite,Base internet"
      ]
    },
    {
      "tag": "medical",
      "patterns": [
        "je ne sais pas utiliser Doctolib",
        "Comment je peux trouver un medcin pour un rendez-vous medical sur Doctolib?",
        "Je veux creer un compte sur Doctolib ?",
        "Comment je peux faire pour trouver un rendez-vous medical sur Doctolib?",
        "Je veux trouver un rendez-vous medical sur Doctolib",
        "Comment trouver un medcin pour un rendez vous medical sur Doctolib ",
        "Je veux prendre un rendez-vous medical avec un medecin sur Doctolib",
        "Comment annuler mon rendez-vous medical sur Doctolib ?",
        "Comment modifier mon rendez-vous medical sur Doctolib ?",
        "Comment avoir des informations dans le domaine medical ?",
        "Comment utiliser Doctlib  pour prendre un rendez-vous medical ?",
        "Commment  trouver des ressorces pour la thematiques sante ?",
        "Commment  trouver des ressorces dans le domaine de la sante ?",
        "Ou je peux trouver les videos de Doctolib ?",
        "Ou je peux trouver des videos sur l'utilisation de Doctolib ?",
        "Est-ce-que je peux trouver des videos concernant  Doctilib ?"
        
      ],
      "responses": [
        "Pour toutes information concernant vos rendez-vous medical sur Doctlib aller sur la page d'accueil et defiler en bas jusqu'a la thematique sante",
        "Vous pouvez aller a la page d'accueil de notre platforme vous trouverez toutes les informations concernant l'utilisation de la platforme Doctolib",
        "On a mis plusieurs videos sur la platforme pour vous accompagner dans vos demarches medical sur Doctolib",
        "Aller a la thematiques sante dans le page ressource de notre platforme vous trouverez toute les informations concernant l'utlisation de Doctolib",
        "Pour regarder les videos corncernant Doctolib aller a la thematiques sante dans la page ressource de notre platforme vous trouverez toute les informations concernant l'utlisation de Doctolib ou bien aller dans notre chaine youtube"
      ]
    },
    {
      "tag": "formulaire",
      "patterns": [
        "J'arrive pas à remplir un formulaire",
        "J'ai un probleme pour à insérer un fichier dans dans un formulaire",
        "Comment rempir un formulaire ?",
        "Ou je peux trouver des videos pour remplir un formulaire ?",
        "Je veux apprendre à remplir un formulaire ?"

      ],
      "responses": [
        "Pour savoir comment remplir un formulaire aller à la page ressource y'a des videos la-bas",
        "Pour trouver des videos sur comment remplir un formulaire aller à la page ressource y'a des videos la-bas",
        "Pour apprendre comment remplir un formulaire aller à la page ressource y'a des videos la-bas",
        "Pour toute information concernant le remplisage de formulaire aller à la page ressource y'a des videos la-bas"
      ]
    },
    {
      "tag": "windows",
      "patterns": [
        "Comment creer un dossier sur windows",
        "j'arrive pas à creer un dossier sur windows",
        "Comment supprimer un dossier sur windows ?",
        "Comment deplacer un dossier sur windows",
        "Comment mettre à jour mon systeme windows"
      ],
      "responses": [
        "Pour creer un dossier sur windows aller à la page ressource y'a des videos la-bas",
        "Pour trouver des videos sur comment creer  un dossier sur windows aller à la page ressource y'a des videos la-bas",
        "Pour apprendre comment creer un dossier sur windows aller à la page ressource y'a des videos la-bas",
        "Pour toute information concernant la creation ,la suppression ou le deplacement de dossier sur windows aller à la page ressource y'a des videos la-bas"
      ]
    },
    {
      "tag": "mac",
      "patterns": [
        "Comment creer un dossier sur mac ?",
        "j'arrive pas à creer un dossier sur mac",
        "Comment supprimer un dossier sur mac ?",
        "Comment deplacer un dossier sur mac",
        "Comment mettre à jour mon systeme mac"
      ],
      "responses": [
        "Pour creer un dossier sur mac aller à la page ressource y'a des videos la-bas",
        "Pour trouver des videos sur comment creer  un dossier sur mac aller à la page ressource y'a des videos la-bas",
        "Pour apprendre comment creer un dossier sur mac aller à la page ressource y'a des videos la-bas",
        "Pour toute information concernant la creation ,la suppression ou le deplacement de dossier sur mac aller à la page ressource y'a des videos la-bas"
      ]
    }
  ]
}
